In [3]:
import numpy as np
import pandas as pd

In [9]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
             index =['서울','부산','인천','대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [11]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [13]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [14]:
s.name = '인구'          # 시리즈에 이름을 부여할 수 있음 .name
s.index.name = '도시'  # 인덱스에 이름을 부여할 수 있음.index.name
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [15]:
s/1000000       # 시리즈의 인덱스 값은 변하지 않고 값에만 연산을 할 수 있음

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [17]:
s[1], s['부산']     # 변수[] 인덱스 외 변수['인덱스명'] 으로 인덱싱 가능

(3448737, 3448737)

In [18]:
s[[0, 3, 1]]      # 배열인덱싱으로 여러개의 인덱스,값을 부러오고 순서도 변경가능

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [20]:
s[["서울", "대구", "부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [21]:
s[(250e4 < s) & (s < 500e4)]      # 조건식 적용 가능

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [22]:
s[1:3]      # 슬라이싱 가능

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [24]:
s["부산":"대구"]     # 인덱스 명으로 슬라이싱 할 경우 슬라이싱 마지막 부분까지

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [26]:
s0 = pd.Series(range(3), index = ['a','b','c'])     # 인덱스 명이 영문일경우 
s0

a    0
b    1
c    2
dtype: int64

In [28]:
s0.a      # .a <- 처럼 dot을 활용 가능

0

In [29]:
"서울" in s

True

In [30]:
"대전" in s

False

In [32]:
'서울' in s, '대전' in s

(True, False)

In [33]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [34]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [35]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"])
s2     # 딕셔너리는 순서가 보장되지 않음, 시리즈 정의시 인덱스 순서 지정가능

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [37]:
ds = s - s2      # 대전 대구는 비교자료에 한쪽에 포함되지 않아 NaN의 값을 가짐
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [38]:
s.values - s2.values     # 인덱스를 무시하고 데이터 연산 시

array([ 6511121, -6182745,   258416,   975894], dtype=int64)

In [39]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [40]:
ds[ds.notnull()]      # NaN으로 표시안되고 비교가 안되는 값은 제외

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [41]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [42]:
rs["부산"] = 1.63      # 부산의 값을 1.63으로 갱신
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [43]:
rs["대구"] = 1.41     # 대구의 값을 1.41로 갱신 적용
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [44]:
del rs["서울"]        # 인덱스 삭제도 가능
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

## 2.2 Data Frame

In [45]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [50]:
df.index, df.columns     # .index 는 행방향, columns는 열방향

(Index(['서울', '부산', '인천', '대구'], dtype='object'),
 Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object'))

In [52]:
df.values     # .values는 값 출력

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [54]:
df.index.name = "도시"
df.columns.name = "특성"       # index, columns의 각 네임을 지정
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

#### 연습문제 2
- 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

- 1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
- 2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [55]:
df.T      # 행과 열을 바꿔서 표현

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [56]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df    # 기존의 값을 연산 후 갱신 가능

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [58]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [59]:
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [60]:
df["지역"]      # columns의 이름으로 출력 가능 / series 자료형으로 출력됨

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [61]:
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [62]:
df[["2010"]]        #  [[]]   괄호를 2개를 쓰면 data frame 자료형이 되서 출력됨

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [63]:
type(df[["2010"]]), type(df["2010"])    # 괄호 [] series, [[]] data frame

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [64]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [65]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int32

In [66]:
df2[[1, 2]]

   1   2
0  1   2
1  5   6
2  9  10

In [68]:
df[:1]      # 행인덱싱의 경우 꼭 슬라이싱을 붙어야함

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [69]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [70]:
df[1:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [71]:
df[3:4]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [72]:
df["서울":"부산"]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40